# CreateBoolean Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateBoolean Method
IFCData Class See Also
---
Creates a boolean data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateBoolean(
	bool value
)
```

Visual Basic
---
```text
Public Shared Function CreateBoolean ( _
	value As Boolean _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateBoolean(
	bool value
)
```

# ### Parameters
value
    Type: System..::..Boolean The boolean value.
# ### Return Value
The IFCData object.
# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace